app/controllers/complaints_controller.rb

SELECT `complaints`.* FROM `complaints`
---
	def index
		@complaints = Complaint.all

INSERT INTO `complaints` (`created_at`, `description`, `latitude`, `longitude`, `updated_at`) VALUES ('2015-04-29 14:47:45', 'hey', 10.0, 10.0, '2015-04-29 14:47:45')
---
	def create
		@complaint = Complaint.new(complaint_params)
		if @complaint.save